# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv11-DN with Standard Detect Head
# 使用标准检测头的YOLOv11-DN（用于调试和对比）
# Enhanced with domain adaptation modules but using standard Detect head

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # nano: lightweight for edge devices
  # s: [0.50, 0.50, 1024] # small: balanced performance
  # m: [0.50, 1.00, 512]  # medium: high performance
  # l: [1.00, 1.00, 512]  # large: very high performance
  # x: [1.00, 1.50, 512]  # xlarge: maximum performance

# YOLOv11-DN backbone (with domain adaptation)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4
  - [-1, 1, Conv, [512, 3, 2]]             # 5-P4/16
  - [-1, 2, C3k2_DN, [512, True]]          # 6-DN (Domain-Normalized C3k2)
  - [-1, 1, Conv, [1024, 3, 2]]            # 7-P5/32
  - [-1, 2, C3k2_DN, [1024, True]]         # 8-DN (Domain-Normalized C3k2)
  - [-1, 1, SPPF, [1024, 5]]            # 9-MS (Multi-Scale SPPF)
  - [-1, 2, C2PSA, [1024]]                 # 10

# YOLOv11-DN head (with standard Detect)
head:
  # Top-down pathway
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]              # 12 cat backbone P4
  - [-1, 2, C3k2_DN, [512, False]]         # 13-DN

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]              # 15 cat backbone P3
  - [-1, 2, C3k2_DN, [256, False]]         # 16-DN (P3/8-small)

  # Bottom-up pathway
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]             # 18 cat head P4
  - [-1, 2, C3k2_DN, [512, False]]         # 19-DN (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]             # 21 cat head P5
  - [-1, 2, C3k2_DN, [1024, True]]         # 22-DN (P5/32-large)

  # Standard Detection Head (替代Detect_DR)
  - [[16, 19, 22], 1, Detect, [nc]]        # 23 Detect(P3, P4, P5)

